public class Main {
    public static void main(String[] args) {
int x = 24567;
int y = x / 200;
        System.out.println("Ваши бонусные баллы: " + y);
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
